hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/inc/hc32m120_timera.h
/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/

/*******************************************************************************
  Global function prototypes (definition in C source)
 ******************************************************************************/
/**
 * @addtogroup TIMERA_Global_Functions
 * @{
 */

/**
 * @brief  Set trigger event source.
 * @param  [in] enEvtSrc                Trigger event source @ref en_event_src_t
 * @retval None
 */
__STATIC_INLINE void TIMERA_SetTriggerSrc(en_event_src_t enEvtSrc)
{
    WRITE_REG32(M0P_AOS->TMRA_HTSSR, enEvtSrc);
}

/* Initialization and configuration TimerA base functions */
en_result_t TIMERA_DeInit(M0P_TMRA_TypeDef *TMRAx);
en_result_t TIMERA_Init(M0P_TMRA_TypeDef *TMRAx,
                        const stc_timera_init_t *pstcInit);
en_result_t TIMERA_StructInit(stc_timera_init_t *pstcInit);
void TIMERA_SetCounter(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Value);
uint16_t TIMERA_GetCounter(M0P_TMRA_TypeDef *TMRAx);
void TIMERA_SetPeriod(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Value);
uint16_t TIMERA_GetPeriod(M0P_TMRA_TypeDef *TMRAx);
void TIMERA_SetClkDiv(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Div);
void TIMERA_EventCmd(M0P_TMRA_TypeDef *TMRAx, uint16_t u16EvtSource,
                     en_functional_state_t enNewSta);
void TIMERA_Cmd(M0P_TMRA_TypeDef *TMRAx, en_functional_state_t enNewSta);
void TIMERA_SetTrigFilterClkDiv(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Div);
void TIMERA_TrigFilterCmd(M0P_TMRA_TypeDef *TMRAx, en_functional_state_t enNewSta);
void TIMERA_SetClkAFilterClkDiv(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Div);
void TIMERA_ClkAFilterCmd(M0P_TMRA_TypeDef *TMRAx, en_functional_state_t enNewSta);
void TIMERA_SetClkBFilterClkDiv(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Div);
void TIMERA_ClkBFilterCmd(M0P_TMRA_TypeDef *TMRAx, en_functional_state_t enNewSta);

/* Configuration TimerA Hardware trigger functions */
void TIMERA_SetHwTriggerCondition(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Condition);
uint16_t TIMERA_GetHwTriggerCondition(M0P_TMRA_TypeDef *TMRAx);
void TIMERA_SetHwStartCondition(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Condition);
void TIMERA_SetHwStopCondition(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Condition);
void TIMERA_SetHwClearCondition(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Condition);
void TIMERA_SetHwUpCondition(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Condition);
uint16_t TIMERA_GetHwUpCondition(M0P_TMRA_TypeDef *TMRAx);
void TIMERA_SetHwDownCondition(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Condition);
uint16_t TIMERA_GetHwDownCondition(M0P_TMRA_TypeDef *TMRAx);

/* Initialization and configuration TimerA input capture functions */
en_result_t TIMERA_IC_DeInit(M0P_TMRA_TypeDef *TMRAx,
                             uint8_t u8Channel);
en_result_t TIMERA_IC_Init(M0P_TMRA_TypeDef *TMRAx, uint8_t u8Channel,
                           const stc_timera_ic_init_t *pstcIcInit);
en_result_t TIMERA_IC_StructInit(stc_timera_ic_init_t *pstcIcInit);
uint16_t TIMERA_IC_GetCapture(M0P_TMRA_TypeDef *TMRAx,
                              uint8_t u8Channel);
void TIMERA_IC_SetCaptureCondition(M0P_TMRA_TypeDef *TMRAx,
                                   uint8_t u8Channel,
                                   uint16_t u16Condition);
void TIMERA_IC_FilterCmd(M0P_TMRA_TypeDef *TMRAx, uint8_t u8Channel,
                         en_functional_state_t enNewSta);
void TIMERA_IC_SetFilterClkDiv(M0P_TMRA_TypeDef *TMRAx,
                               uint8_t u8Channel, uint16_t u16Div);

/* Initialization and configuration TimerA output compare functions */
en_result_t TIMERA_OC_DeInit(M0P_TMRA_TypeDef *TMRAx,
                             uint8_t u8Channel);
en_result_t TIMERA_OC_Init(M0P_TMRA_TypeDef *TMRAx, uint8_t u8Channel,
                           const stc_timera_oc_init_t *pstcOcInit);
en_result_t TIMERA_OC_StructInit(stc_timera_oc_init_t *pstcOcInit);
void TIMERA_OC_SetCompare(M0P_TMRA_TypeDef *TMRAx, uint8_t u8Channel,
                          uint16_t u16Value);
void TIMERA_OC_PwmCmd(M0P_TMRA_TypeDef *TMRAx, uint8_t u8Channel,
                      en_functional_state_t enNewSta);
void TIMERA_OC_SetStartCountOutputPolarity(M0P_TMRA_TypeDef *TMRAx,
                                           uint8_t u8Channel,
                                           uint16_t u16Polarity);
void TIMERA_OC_SetStopCountOutputPolarity(M0P_TMRA_TypeDef *TMRAx,
                                          uint8_t u8Channel,
                                          uint16_t u16Polarity);
void TIMERA_OC_SetCmpMatchOutputPolarity(M0P_TMRA_TypeDef *TMRAx,
                                         uint8_t u8Channel,
                                         uint16_t u16Polarity);
void TIMERA_OC_SetPeriodMatchOutputPolarity(M0P_TMRA_TypeDef *TMRAx,
                                            uint8_t u8Channel,
                                            uint16_t u16Polarity);
void TIMERA_OC_SetForceOutputPolarity(M0P_TMRA_TypeDef *TMRAx,
                                      uint8_t u8Channel,
                                      uint16_t u16Polarity);
en_result_t TIMERA_OC_CacheCmd(M0P_TMRA_TypeDef *TMRAx,
                               uint8_t u8Channel,
                               en_functional_state_t enNewSta);
en_result_t TIMERA_OC_SetCacheTransmitCondition(M0P_TMRA_TypeDef *TMRAx,
                                                uint8_t u8Channel,
                                                uint16_t u16Condition);

/* Interrupts and flags management functions */
en_flag_status_t TIMERA_GetFlag(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Flag);
void TIMERA_ClearFlag(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Flag);
void TIMERA_IntCmd(M0P_TMRA_TypeDef *TMRAx, uint16_t u16IntSource,
                   en_functional_state_t enNewSta);

/**
 * @}
 */

#endif /* DDL_TIMERA_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __HC32M120_TIMERA_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
